src/Catalogs/am_Бренды/am_Бренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>am_Бренды</name>
  <attributes>
    <name>Качество</name>
    <type>
      <types>EnumRef.am_КачествоТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Диапазон</name>
    <attributes>
      <name>От</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/am_Бренды/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаНаценки.Видимость =  РегистрыСведений.am_ХранилищеНастроек.ПолучитьРазрешитьПроцентНаценкиВБрендах();
	//Элементы.ПроцентНаценки.Видимость = РегистрыСведений.am_ХранилищеНастроек.ПолучитьРазрешитьПроцентНаценкиВБрендах();
	Если Элементы.ГруппаНаценки.Видимость Тогда
		ФиктивнаяНаценка = Объект.Диапазон.Итог("Процент");
		ВидимостьДиапазона = Объект.Диапазон.Количество() > 1;
		Элементы.ФиктивнаяНаценка.Видимость = НЕ ВидимостьДиапазона;
		Элементы.ГруппаДиапазон.Видимость = ВидимостьДиапазона;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДиапазонаПриИзменении(Элемент)
	Элементы.ФиктивнаяНаценка.Видимость = НЕ ВидимостьДиапазона;
	Элементы.ГруппаДиапазон.Видимость = ВидимостьДиапазона;
КонецПроцедуры

&НаСервере
Процедура ФиктивнаяНаценкаПриИзмененииНаСервере()
	Если Объект.Диапазон.Количество() = 0 Тогда
		НоваяСтрока = Объект.Диапазон.Добавить();
		НоваяСтрока.От = 0;
		НоваяСтрока.До = 999999;
	КонецЕсли;
	Объект.Диапазон[0].Процент = ФиктивнаяНаценка;
КонецПроцедуры

&НаКлиенте
Процедура ФиктивнаяНаценкаПриИзменении(Элемент)
	ФиктивнаяНаценкаПриИзмененииНаСервере();
КонецПроцедуры
